app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
<label for="article_category_id">Category: </label><br/>
	<%= f.collection_select :category_id, Category.all, :id, :name, prompt: "Select Category" %> <br/>